; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	image3 - mode
	thermograph0 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 146)
	(= (data Planet4 image1) 221)
	(= (data Planet5 image1) 66)
	(= (data Star6 image1) 66)
	(= (data Planet7 image1) 229)
	(= (data Star8 image1) 42)
	(= (data Planet4 image3) 33)
	(= (data Planet5 image3) 293)
	(= (data Star6 image3) 105)
	(= (data Planet7 image3) 180)
	(= (data Star8 image3) 144)
	(= (data Planet4 thermograph0) 17)
	(= (data Planet5 thermograph0) 211)
	(= (data Star6 thermograph0) 172)
	(= (data Planet7 thermograph0) 114)
	(= (data Star8 thermograph0) 148)
	(= (data Planet4 infrared2) 50)
	(= (data Planet5 infrared2) 202)
	(= (data Star6 infrared2) 199)
	(= (data Planet7 infrared2) 3)
	(= (data Star8 infrared2) 173)
	(= (slew_time GroundStation2 Star0) 9.164)
	(= (slew_time Star0 GroundStation2) 9.164)
	(= (slew_time GroundStation2 GroundStation1) 63.1)
	(= (slew_time GroundStation1 GroundStation2) 63.1)
	(= (slew_time Star3 Star0) 65.38)
	(= (slew_time Star0 Star3) 65.38)
	(= (slew_time Star3 GroundStation1) 10.47)
	(= (slew_time GroundStation1 Star3) 10.47)
	(= (slew_time Star3 GroundStation2) 49.48)
	(= (slew_time GroundStation2 Star3) 49.48)
	(= (slew_time GroundStation1 Star0) 53.73)
	(= (slew_time Star0 GroundStation1) 53.73)
	(= (slew_time Planet4 Star0) 25.39)
	(= (slew_time Star0 Planet4) 25.39)
	(= (slew_time Planet4 GroundStation1) 15.14)
	(= (slew_time GroundStation1 Planet4) 15.14)
	(= (slew_time Planet4 GroundStation2) 49.16)
	(= (slew_time GroundStation2 Planet4) 49.16)
	(= (slew_time Planet4 Star3) 70.02)
	(= (slew_time Star3 Planet4) 70.02)
	(= (slew_time Planet5 Star0) 10.97)
	(= (slew_time Star0 Planet5) 10.97)
	(= (slew_time Planet5 GroundStation1) 66.08)
	(= (slew_time GroundStation1 Planet5) 66.08)
	(= (slew_time Planet5 GroundStation2) 3.838)
	(= (slew_time GroundStation2 Planet5) 3.838)
	(= (slew_time Planet5 Star3) 34.98)
	(= (slew_time Star3 Planet5) 34.98)
	(= (slew_time Planet5 Planet4) 37.6)
	(= (slew_time Planet4 Planet5) 37.6)
	(= (slew_time Star6 Star0) 47.21)
	(= (slew_time Star0 Star6) 47.21)
	(= (slew_time Star6 GroundStation1) 41.69)
	(= (slew_time GroundStation1 Star6) 41.69)
	(= (slew_time Star6 GroundStation2) 65.13)
	(= (slew_time GroundStation2 Star6) 65.13)
	(= (slew_time Star6 Star3) 49.88)
	(= (slew_time Star3 Star6) 49.88)
	(= (slew_time Star6 Planet4) 2.069)
	(= (slew_time Planet4 Star6) 2.069)
	(= (slew_time Star6 Planet5) 4.026)
	(= (slew_time Planet5 Star6) 4.026)
	(= (slew_time Planet7 Star0) 0.8138)
	(= (slew_time Star0 Planet7) 0.8138)
	(= (slew_time Planet7 GroundStation1) 49.88)
	(= (slew_time GroundStation1 Planet7) 49.88)
	(= (slew_time Planet7 GroundStation2) 8.78)
	(= (slew_time GroundStation2 Planet7) 8.78)
	(= (slew_time Planet7 Star3) 40.52)
	(= (slew_time Star3 Planet7) 40.52)
	(= (slew_time Planet7 Planet4) 33.8)
	(= (slew_time Planet4 Planet7) 33.8)
	(= (slew_time Planet7 Planet5) 2.847)
	(= (slew_time Planet5 Planet7) 2.847)
	(= (slew_time Planet7 Star6) 49.65)
	(= (slew_time Star6 Planet7) 49.65)
	(= (slew_time Star8 Star0) 79.05)
	(= (slew_time Star0 Star8) 79.05)
	(= (slew_time Star8 GroundStation1) 19.41)
	(= (slew_time GroundStation1 Star8) 19.41)
	(= (slew_time Star8 GroundStation2) 68.54)
	(= (slew_time GroundStation2 Star8) 68.54)
	(= (slew_time Star8 Star3) 13.35)
	(= (slew_time Star3 Star8) 13.35)
	(= (slew_time Star8 Planet4) 14.19)
	(= (slew_time Planet4 Star8) 14.19)
	(= (slew_time Star8 Planet5) 31.59)
	(= (slew_time Planet5 Star8) 31.59)
	(= (slew_time Star8 Star6) 18.03)
	(= (slew_time Star6 Star8) 18.03)
	(= (slew_time Star8 Planet7) 14.84)
	(= (slew_time Planet7 Star8) 14.84)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Planet4 infrared2)
	(have_image Planet5 infrared2)
	(have_image Star6 infrared2)
	(have_image Planet7 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 146 to 104.31, (fuel-used) from 0 to 41.69
   goals met: 1 of 5
2. (turn_to satellite0 groundstation1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 104.31 to 62.62, (fuel-used) from 41.69 to 83.38
   goals met: 0 of 5
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 62.62 to 20.93, (fuel-used) from 83.38 to 125.07
   goals met: 1 of 5
6. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 20.93 to 18.861, (fuel-used) from 125.07 to 127.139
   goals met: 0 of 5
7. (take_image satellite0 planet4 instrument0 infrared2)
   added: (have_image planet4 infrared2)
   changed: (data_capacity satellite0) from 1000 to 950, (data-stored) from 0 to 50
   goals met: 1 of 5
8. (turn_to satellite0 star6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 18.861 to 16.792, (fuel-used) from 127.139 to 129.208
   goals met: 2 of 5
9. (turn_to satellite0 planet5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 16.792 to 12.766, (fuel-used) from 129.208 to 133.234
   goals met: 1 of 5
10. (turn_to satellite0 planet7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 12.766 to 9.919, (fuel-used) from 133.234 to 136.081
   goals met: 1 of 5
11. (take_image satellite0 planet7 instrument0 infrared2)
   added: (have_image planet7 infrared2)
   changed: (data_capacity satellite0) from 950 to 947, (data-stored) from 50 to 53
   goals met: 2 of 5
12. (turn_to satellite0 planet5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 9.919 to 7.072, (fuel-used) from 136.081 to 138.928
   goals met: 2 of 5
13. (take_image satellite0 planet5 instrument0 infrared2)
   added: (have_image planet5 infrared2)
   changed: (data_capacity satellite0) from 947 to 745, (data-stored) from 53 to 255
   goals met: 3 of 5
14. (turn_to satellite0 star6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 7.072 to 3.046, (fuel-used) from 138.928 to 142.954
   goals met: 4 of 5
15. (take_image satellite0 star6 instrument0 infrared2)
   added: (have_image star6 infrared2)
   changed: (data_capacity satellite0) from 745 to 546, (data-stored) from 255 to 454
   goals met: 5 of 5
